IDEA Open Model
OpenMessages.WarningMessages Property
Compatible with IDEA StatiCa v 10.1
 List Worning messages only
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public List<WarningMessage> WarningMessages { get; }
Public ReadOnly Property WarningMessages As List(Of WarningMessage)
	Get
public:
property List<WarningMessage^>^ WarningMessages {
	List<WarningMessage^>^ get ();
}
Property Value
Type: List<WarningMessage>
See Also
Reference
OpenMessages Class
IdeaRS.OpenModel.Message Namespace